
#Область ПрограммныйИнтерфейс

Процедура ДФ_РассчитатьСуммуСтрокиСоСкидкой(ТекущиеДанные, СкидкаШапки) Экспорт
	
	ТекущиеДанные.Сумма = ДФ_РассчитатьСуммуСоСкидками(
		ТекущиеДанные.Цена,
		ТекущиеДанные.Количество,
		ТекущиеДанные.Скидка,
		СкидкаШапки
	);
	
КонецПроцедуры

Процедура ДФ_ПересчитатьВсеСтроки(ТабличнаяЧастьТовары, ТабличнаяЧастьУслуги, СкидкаШапки) Экспорт
		
	ДФ_ПересчитатьТабличнуюЧасть(ТабличнаяЧастьТовары, СкидкаШапки);
	ДФ_ПересчитатьТабличнуюЧасть(ТабличнаяЧастьУслуги, СкидкаШапки);
		
КонецПроцедуры

Функция ДФ_РассчитатьСуммуСоСкидками(Цена, Количество, СкидкаСтроки, СкидкаШапки) Экспорт
	
	СкидкаИтог = Мин(СкидкаСтроки + СкидкаШапки, 100);
	
	Коэффициент = 1 - (СкидкаИтог / 100);
	Возврат Цена * Количество * Коэффициент;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДФ_ПересчитатьТабличнуюЧасть(ТабличнаяЧасть, СкидкаШапки)
	
	Для Каждого Строка Из ТабличнаяЧасть Цикл
		Строка.Сумма = ДФ_РассчитатьСуммуСоСкидками(
			Строка.Цена,
			Строка.Количество,
			Строка.Скидка,
			СкидкаШапки
		);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


