
#Область ПрограммныйИнтерфейс

Процедура ДобавитьБлокПересчётаСоСкидкой(Форма) Экспорт
	
	Если Форма.ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		
		РодительскаяГруппаШапкаЛево = Форма.Элементы.ГруппаШапкаЛево;
		
		НоваяГруппа = Форма.Элементы.Добавить("ГруппаПересчётСоСкидкой", Тип("ГруппаФормы"), РодительскаяГруппаШапкаЛево);
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		
		ДобавитьПолеСогласованнаяСкидка(Форма, НоваяГруппа);
		ДобавитьКомандуПересчёта(Форма, НоваяГруппа);
		
	КонецЕсли;	
	
КонецПроцедуры

Процедура Дополнитьформу(Форма) Экспорт  
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьПолеСогласованнаяСкидка(Форма, ГруппаРодитель)
	
	НовыйЭлементСогласованнаяСкидка = Форма.Элементы.Добавить("ДФ_СогласованнаяСкидка", Тип("ПолеФормы"), ГруппаРодитель);
	НовыйЭлементСогласованнаяСкидка.ПутьКДанным = "Объект.ДФ_СогласованнаяСкидка";
	НовыйЭлементСогласованнаяСкидка.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлементСогласованнаяСкидка.Заголовок = "Согласованная скидка";
	НовыйЭлементСогласованнаяСкидка.УстановитьДействие("ПриИзменении", "ДФ_СогласованнаяСкидкаПриИзменении");
	
КонецПроцедуры

Процедура ДобавитьКомандуПересчёта(Форма, ГруппаРодитель)
	
	КомандаПересчёта = Форма.Команды.Добавить("ДФ_ПересчитатьТаблицу");
	КомандаПересчёта.Заголовок = "Пересчитать таблицу";
	КомандаПересчёта.Действие = "ДФ_ПересчитатьТаблицу";
	
	КнопкаКомандыПересчёта = Форма.Элементы.Добавить("ПересчитатьТаблицу", Тип("КнопкаФормы"), ГруппаРодитель);
	КнопкаКомандыПересчёта.ИмяКоманды = "ДФ_ПересчитатьТаблицу";
	КнопкаКомандыПересчёта.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоВГруппаШапкаПраво(Форма)
	
	ГруппаШапкаПраво = Форма.Элементы.ГруппаШапкаПраво;
	
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), ГруппаШапкаПраво);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДФ_КонтактноеЛицо";
	
КонецПроцедуры

Процедура ДобавитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма)
	
	ПолеСуммаДокумента = Форма.Элементы.СуммаДокумента;
	
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), , ПолеСуммаДокумента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДФ_КонтактноеЛицо";
	
КонецПроцедуры

#КонецОбласти


